Documents/УстановкаЦенМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаЦенМатериалов</Name>
			<Comment>Установка цен материалов (для расчета стоимости потолка)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныПараметровПродукции</xr:Item>
				<xr:Item>InformationRegister.ЦеныМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрироватьНулевыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСФотопечатьюОтличается</Name>
					<Comment>#12615</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияСтоимостиПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фактура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветФактуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСФотопечатью</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрПродукции</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериалов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСФотопечатью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПараметровПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПараметровПродукции</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрПродукции</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыОпределенияСтоимостиПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияСтоимостиПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПараметрам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоШаблону</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаЦенМатериалов/Ext/ObjectModule.bsl
#Область ОбработкаСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		Валюта 		= ДанныеЗаполнения.Валюта;
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Основание 	= ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
				СтруктураЦветаИФактуры = Справочники.ЦветФактуры.ПолучитьЦветИФактуруНоменклатуры(ТекСтрокаТовары.Номенклатура);
				Если СтруктураЦветаИФактуры.Результат Тогда				
					НоваяСтрока = Материалы.Добавить();
					НоваяСтрока.Фактура 	= СтруктураЦветаИФактуры.Фактура;
					НоваяСтрока.ЦветФактуры = СтруктураЦветаИФактуры.ЦветФактуры;
					НоваяСтрока.Цена 		= ТекСтрокаТовары.Цена;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВидПродукции"));	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//#12615	
	Если ЦенаСФотопечатьюОтличается	И ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда
		ЦенаСФотопечатьюОтличается = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ЭтоПродукция = Ложь;
	Если ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция") Тогда
		ЭтоПродукция = Истина;
		ЦеныНаПродукциюПоШаблону    = (СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоШаблону);
		ЦеныНаПродукциюПоПараметрам = (СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоПараметрам);
		ЦеныНаПродукциюПоНоменклатуре = (СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоНоменклатуре);
	КонецЕсли;
	
	ЭтоПотолокОтрез = (ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок")
				       ИЛИ ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"));
					   
	// регистр ЦеныМатериалов
	Если ЭтоПотолокОтрез 
		ИЛИ (ЭтоПродукция И ЦеныНаПродукциюПоШаблону) 
		ИЛИ (ЭтоПродукция И ЦеныНаПродукциюПоНоменклатуре)
		Тогда
		Движения.ЦеныМатериалов.Записывать = Истина;
		Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
			ЦенаСФотопечатью = ?(ЦенаСФотопечатьюОтличается, ТекСтрокаМатериалы.ЦенаСФотопечатью, ТекСтрокаМатериалы.Цена); //#12615
			Если НеРегистрироватьНулевыеЦены И ТекСтрокаМатериалы.Цена = 0 И ЦенаСФотопечатью = 0 Тогда
				Продолжить;
			КонецЕсли;
			Движение = Движения.ЦеныМатериалов.Добавить();
			Движение.Период				= Дата;
			Движение.Валюта 			= Валюта;
			Движение.ВидНоменклатуры 	= ВидНоменклатуры;
			Движение.ВидЦен 			= ТекСтрокаМатериалы.ВидЦены;
			Движение.Цена 				= ТекСтрокаМатериалы.Цена;
			Если ЭтоПродукция Тогда
				Если ЦеныНаПродукциюПоШаблону Тогда
					Движение.Шаблон 			= ТекСтрокаМатериалы.Шаблон;
				ИначеЕсли ЦеныНаПродукциюПоНоменклатуре Тогда
					Движение.Номенклатура 		= ТекСтрокаМатериалы.Номенклатура;
					Движение.ЕдиницаИзмерения 	= ТекСтрокаМатериалы.ЕдиницаИзмерения;
				КонецЕсли;
			Иначе
				Движение.Фактура 			= ТекСтрокаМатериалы.Фактура;
				Движение.ЦветФактуры 		= ТекСтрокаМатериалы.ЦветФактуры;		
				Движение.ЦенаСФотопечатью 	= ЦенаСФотопечатью;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// регистр ЦеныПараметровПродукции
	Если ЭтоПродукция И ЦеныНаПродукциюПоПараметрам Тогда
		Движения.ЦеныПараметровПродукции.Записывать = Истина;
		Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
			Если НеРегистрироватьНулевыеЦены И ТекСтрокаМатериалы.Цена = 0 Тогда
				Продолжить;
			КонецЕсли;
			Движение = Движения.ЦеныПараметровПродукции.Добавить();
			Движение.Период				= Дата;
			Движение.Валюта 			= Валюта;
			Движение.ВидПродукции 		= ВидПродукции;
			Движение.ВидЦены 			= ТекСтрокаМатериалы.ВидЦены;		
			Движение.ПараметрПродукции 	= ТекСтрокаМатериалы.ПараметрПродукции;
			Движение.Цена 				= ТекСтрокаМатериалы.Цена;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
